[
  {
    "Title": "All Quiet on the Western Front",
    "Release": "2022",
    "Actors": [
      "Felix Kammerer",
      "Albrecht Schuch",
      "Aaron Hilmer",
      "Daniel Brühl",
      "Devid Striesow"
    ],
    "Rated": "R",
    "Rating": "90",
    "Description": "The story follows teenagers Paul Baumer and his friends Albert and Muller, who voluntarily enlist in the German army, riding a wave of patriotic fervor that quickly dissipates once they face the brutal realities of life on the front. Paul's preconceptions about the enemy and the rights and wrongs of the conflict soon crumble. However, amid the countdown to armistice, Paul must carry on fighting until the end, with no purpose other than to satisfy the top brass' desire to end the war on a German offensive.",
    "Genre": {
      "Name": "War",
      "Description": "War film is film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama. It has been strongly associated with the 20th century. The fateful nature of battle scenes means that war films often end with them. Themes explored include combat, survival and escape, camaraderie between soldiers, sacrifice, the futility and inhumanity of battle, the effects of war on society, and the moral and human issues raised by war."
    },
    "Director": {
     "Name": "Edward Berger",
      "Bio": "Edward Berger was born in 1970 in Wolfsburg, Lower Saxony, Germany. He is adirector and writer, known for All Quiet on the Western Front (2022), Jack (2014) and Deutschland 83 (2015). He is married to Nele Mueller-Stofen.",
      "Birth": "1970-01-01"
    },
    "Image": "https://m.media-amazon.com/images/M/MV5BMzM4ZDJhYjYtZGY5Ny00NTk0LWI4ZTYtNjczZDFiMGI2ZjEzXkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_FMjpg_UX1000_.jpg",
    "Featured": true,
    "url":"https://www.youtube.com/embed/qFqgmaO15x4?si=g3wpvDQiz4P-7izL",
    "Saved": false
  },
  {
    "Title": "Barbie",
    "Release": "2023",
    "Actors": [
      "Margot Robbie",
      "Ryan Gosling",
      "Issa Rae",
      "Kate McKinnon",
      "Emma Mackey"
    ],
    "Rated": "PG-13",
    "Rating": "80",
    "Description": "Barbie suffers a crisis that leads her to question her world and her existence.",
    "Genre": {
      "Name": "Comedy",
      "Description": "Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."
    },
    "Director": {
      "Name": "Greta Gerwig",
      "Bio": "Greta Gerwig, in full Greta Celeste Gerwig, (born August 4, 1983, Sacramento, California, U.S), American actress, writer, and director who was known for the radiant artlessness of her performances in small independent movies before embarking on a successful career as a filmmaker.",
      "Birth": "1983-08-04"
    },
    "Image": "https://m.media-amazon.com/images/I/71BgdzmFDAL._AC_UF894,1000_QL80_.jpg",
    "Featured": true,
    "url": "https://www.youtube.com/embed/8zIf0XvoL9Y?si=cnJcV1XrsFMMsLFT",
    "Saved": false
  },
  {
    "Title": "Braveheart",
    "Release": "1995",
    "Actors": [
      "Mel Gibson",
      "Sophie Marceau",
      "Patrick McGoohan"
    ],
    "Rated": "R",
    "Rating": "76",
    "Description": "Tells the story of the legendary thirteenth century Scottish hero named William Wallace (Mel Gibson). Wallace rallies the Scottish against the English monarch and Edward I (Peter Hanly) after he suffers a personal tragedy by English soldiers. Wallace gathers a group of amateur warriors that is stronger than any English army.",
    "Genre": {
      "Name": "Historical",
      "Description": "The historical film genre is characterised by its focus on portraying events, societies, and figures from the past. Its a genre that aims to recreate periods in time that are detached from the present, giving viewers a chance to witness historical moments unfold on screen. This can encompass anything from ancient civilisations to biographical studies of historical figures. The significance of historical films lies in their power to educate, entertain, and provoke thought. Initially, historical films were seen as a way to bring the grandeur of history to life with lavish sets and costumes. However, as filmmaking techniques advanced, directors began to focus more on the human stories within the historical context, giving us a deeper understanding of the past."
    },
    "Director": {
      "Name": "Mel Columcille Gerard Gibson",
      "Bio": "Mel Columcille Gerard Gibson was born January 3, 1956 in Peekskill, New York, USA, as the sixth of eleven children of Hutton Gibson, a railroad brakeman, and Anne Patricia (Reilly) Gibson (who died in December of 1990). His mother was Irish, from County Longford, while his American-born father is of mostly Irish descent. Mel and his family moved to Australia in the late 1960s, settling in New South Wales, where Mel's paternal grandmother, contralto opera singer Eva Mylott, was born. After high school, Mel studied at the University of New South Wales in Sydney, performing at the National Institute of Dramatic Arts alongside future film thespians Judy Davis and Geoffrey Rush. After college, Mel had a few stints on stage and starred in a few TV shows. Eventually, he was chosen to star in the films Mad Max (1979) and Tim (1979), co-starring Piper Laurie. The small budgeted Mad Max made him known worldwide, while Tim garnered him an award for Best Actor from the Australian Film Institute (equivalent to the Oscar). Later, he went on to star in Gallipoli (1981), which earned him a second award for Best Actor from the AFI. In 1980, he married Robyn Moore and had seven children. In 1984, Mel made his American debut in The Bounty (1984), which co-starred Anthony Hopkins. Then in 1987, Mel starred in what would become his signature series, Lethal Weapon (1987), in which he played Martin Riggs. In 1990, he took on the interesting starring role in Hamlet (1990), which garnered him some critical praise. He also made the more endearing Forever Young (1992) and the somewhat disturbing The Man Without a Face (1993). 1995 brought his most famous role as Sir William Wallace in Braveheart (1995), for which he won two Oscars for Best Picture and Best Director. From there, he made such box office hits as The Patriot (2000), Ransom (1996), and Payback (1999). Today, Mel remains an international superstar mogul, continuously topping the Hollywood power lists as well as the Most Beautiful and Sexiest lists.",
      "Birth": "1956-01-03"
    },
    "Image": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fwww.themoviedb.org%2Ft%2Fp%2Foriginal%2FhS8ydBynxGB9F8QKnv9KeR1jbOj.jpg&f=1&nofb=1&ipt=4276b6509e987c9f0402a07fbaba3ad1bf18b6efd908b1a96dc4e5a7dfe444cb&ipo=images",
    "url": "https://www.youtube.com/watch?v=1NJO0jxBtMo",
    "Saved": false
  },
  {
    "Title": "Castle in the Sky",
    "Release": "1986",
    "Actors": [ 
      "Mayumi Tanaka", "Keiko Yokozawa", "Kotoe Hatsui"
    ],
    "Rated": "PG",
    "Rating": "96",
    "Description": "A young boy and a girl with a magic crystal must race against pirates and foreign agents in a search for a legendary floating castle.",
    "Genre": {
      "Name": "Anime",
      "Description": "Anime is hand-drawn and computer-generated animation originating from Japan. Outside Japan and in English, anime refers specifically to animation produced in Japan. However, in Japan and in Japanese, anime a term derived from a shortening of the English word animation describes all animated works, regardless of style or origin. Animation produced outside Japan with a similar style to Japanese animation is commonly referred to as anime-influenced animation."
    },
    "Director": {
      "Name": "Hayao Miyazaki",
      "Bio": "Hayao Miyazaki is a Japanese animator, filmmaker, and manga artist. A co-founder of Studio Ghibli, he has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation.",
     "Birth": "1941-01-05"
    },
    "Image": "https://m.media-amazon.com/images/I/71HLiMMNe-L._AC_UF1000,1000_QL80_.jpg",
    "Featured": false,
    "url": "https://www.youtube.com/embed/5lMRfLJGXSM?si=aSfy_EBzVFiFYdyu",
    "Saved": false
  },
  {
    "Title": "Chitty Chitty Bang Bang",
    "Release": "1968",
    "Actors": [
      "Dick Van Dyke",
      "Sally Ann Howes",
      "Lionel Jeffries"
    ],
    "Rated": "G",
    "Rating": "70",
    "Description": "While truant from school, young siblings Jeremy and Jemima meet the beautiful Truly Scrumptious (Sally Ann Howes), who falls for their widowed father, Caractacus Potts (Dick Van Dyke), and his various oddball inventions, including the family's noisy rebuilt car, Chitty Chitty Bang Bang. One day at the beach, Caractacus tells Truly and the children a fanciful fable about the villainous Baron Bomburst (Gert Frobe) and his evil designs on the Potts family car.",
    "Genre": {
      "Name": "Musical",
      "Description": "Musical film, motion picture consisting of a plot integrating musical numbers. Although usually considered an American genre, musical films from Japan, Italy, France, Great Britain, and Germany have contributed to the development of the type. The first musical film, The Jazz Singer (1927), starring Al Jolson, introduced the sound era of motion pictures. It was followed by a series of musicals hastily made to capitalize on the novelty of sound. One of the few outstanding films of this early period was Broadway Melody (1929), which won the Academy Award for best picture of 1928–29."
    },
    "Director": {
      "Name": "Ken Hughes",
      "Bio": "Ken Hughes was an award-winning writer and director who flourished in the 1950s and 1960s, though he continued directing into the early 1980s. Born in Liverpool, England, on January 19, 1922, Hughes decided early in his life that he wanted to be a filmmaker. When he was 14 years old he won an amateur movie-making contest. In 1952 his first feature, the crime drama Wide Boy (1952), was released. By 1955 he was working with imported American character actor Paul Douglas in the quirky Joe MacBeth (1955), a retelling of William Shakespeare's tragedy recast as a modern film noir. Hughes directed the movie and wrote the screenplay. That film led to his directing more English pictures with imported Hollywood B-list stars, including Arlene Dahl and Victor Mature. In a reverse of the Atlantic trade, he exported a script to the US, which was picked up by Alcoa Theater and aired as Eddie (1958) starring Mickey Rooney and directed by Jack Smight. It brought Hughes an Emmy Award for his teleplay. His favorite of his many movies was The Trials of Oscar Wilde (1960) starring Peter Finch as the doomed writer. He was nominated for three BAFTA Awards and Finch took home the BAFTA as Best Actor. It also won the Samuel Goldwyn Award for Best English-Language Foreign Film at the Golden Globes. During the 1960s Hughes worked on A-List pictures, including Of Human Bondage (1964), an adaptation of W. Somerset Maugham's book, but it did not make anyone forget the Bette Davis-Leslie Howard classic of 30 years earlier (Of Human Bondage (1934)). He also toiled as one of the five directors on the cinematic mishmash Casino Royale (1967), which was a box-office smash but a critical bomb. His greatest hit was the adaptation of another Ian Fleming work his children's book Chitty Chitty Bang Bang (1968). The movie was a huge hit, but Hughes was dissatisfied with it. His next picture, the historical epic Cromwell (1970) (1970), got good reviews, but did not burn up the turnstiles at theaters.",
      "Birth": "1922-01-19",
      "Death": "2001-04-28"
    },
    "Image": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fwww.bestmovieposters.co.uk%2Fwp-content%2Fuploads%2F2019%2F01%2FWFfjiCnO.jpeg&f=1&nofb=1&ipt=afa78c133c50161b8f5386f3c55517c3cab6df0451fa8eb5c7259941736b2d1b&ipo=images",
    "Featured": true,
    "url": "https://www.youtube.com/watch?v=ftolP-1944A",
    "Saved": false
  },
  {
    "Title": "A Fistful of Dollars",
    "Release": "1969",
    "Actors": [
      "Clint Eastwood",
      "Gian Maria Volontè",
      "Marianne Koch"
    ],
    "Rated": "R",
    "Rating": "98",
    "Description":"Wandering gunfighter Joe arrives in the Mexican village of San Miguel in the midst of a power struggle among sheriff John Baxter and the three Rojo brothers. When a regiment of Mexican soldiers bearing gold is waylaid by the Rojo brothers, Joe is hired by Esteban to join the gang, but he plays one side against the other.",
    "Genre":{
      "Name": "Western",
      "Description": "Western, a genre of novels and short stories, motion pictures, and television and radio shows that are set in the American West, usually in the period from the 1850s to the end of the 19th century. Though basically an American creation, the western had its counterparts in the gaucho literature of Argentina and in tales of the settlement of the Australian outback. The genre reached its greatest popularity in the early and middle decades of the 20th century and declined somewhat thereafter."
    },
    "Director": {
      "Name": "Sergio Leone",
      "Bio": "Sergio Leone was an Italian filmmaker, credited as the pioneer of the spaghetti Western genre.[1][2] He is widely regarded as one of the most influential directors in the history of cinema. Leone's film-making style includes juxtaposing extreme close-up shots with lengthy long shots. His films include the Dollars Trilogy of Westerns featuring Clint Eastwood: A Fistful of Dollars (1964), For a Few Dollars More (1965), and The Good, the Bad and the Ugly (1966); and the Once Upon a Time films: Once Upon a Time in the West (1968), Duck, You Sucker! (1971), and Once Upon a Time in America (1984).",
      "Birth": "1929-01-03",
      "Death": "1989-04-30"
    },
    "Image": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fi.etsystatic.com%2F23647903%2Fr%2Fil%2F29edad%2F2447535441%2Fil_1588xN.2447535441_92b7.jpg&f=1&nofb=1&ipt=871a73b07f54211a96ff7d72b49b30593eb1ae063cb0e89b25330609b14bce9e&ipo=images",
    "url": "https://youtu.be/-X2DtiE7VLw",
    "Saved": false
  },
  {
    "Title": "Elemental",
    "Release": "2023",
    "Actors": [
      "Leah Lewis",
      "Mamoudou Athie",
      "Ronnie del Carmen",
      "Matthew Yang King"
    ],
    "Rated": "PG",
    "Rating": "74",
    "Description": "Disney and Pixar's Elemental, an all-new, original feature film set in Element City, where fire-, water-, land- and air-residents live together. The story introduces Ember, a tough, quick-witted and fiery young woman, whose friendship with a fun, sappy, go-with-the-flow guy named Wade challenges her beliefs about the world they live in.",
    "Genre": {
      "Name": "Family",
      "Description": "Family film, is a film genre that contains children or relates to them in the context of home and family. These films are made specifically for children and not necessarily for a general audience, while family films are made for a wider appeal with a general audience in mind."
    },
    "Director": {
      "Name": "Peter Sohn",
      "Bio": "Peter Sohnn is an American animator, filmmaker, and voice actor, best known for his work at Pixar Animation Studios. He directed the short film Partly Cloudy 2009 and the feature films The Good Dinosaur 2015 and Elemental 2023. He has also been the voice of Emile in Ratatouille (2007), Squishy in Monsters University 2013, and Sox in Lightyear 2022",
      "Birth": "1977-10-18"
    },
    "Image": "https://m.media-amazon.com/images/I/71u8pWtiz0L._AC_UF894,1000_QL80_.jpg",
    "Featured": true,
    "url": "https://www.youtube.com/embed/hXzcyx9V0xw?si=kyv7cW1fO_Ti-g_C",
    "Saved": false
  },
  {
    "Title": "Guardians of the Galaxy Vol.3",
    "Release": "2023",
    "Actors": [ 
      "Chris Pratt", 
      "Zoe Saldana", 
      "Dave Bautista", 
      "Karen Gillan" 
    ],
    "Rated": "PG-13",
    "Rating": "82",
    "Description": "A group of intergalactic criminals must pull together to stop a fanatical warrior with plans to purge the universe",
    "Genre": {
      "Name": "Sci-Fi",
      "Description": "Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, dinosaurs, mutants, interstellar travel, time travel, or other technologies. Science fiction films have often been used to focus on political or social issues, and to explore philosophical issues like the human condition."
    },
    "Director": {
      "Name": "James Gunn",
      "Bio": "James Francis Gunn Jr. is an American filmmaker and studio executive. He began his career as a screenwriter in the mid-1990s, starting at Troma Entertainment with Tromeo and Juliet 1997. He then began working as a director, starting with the horror-comedy film Slither 2006, and moving to the superhero genre with Super 2010, Guardians of the Galaxy 2014, Guardians of the Galaxy Vol. 2 2017, The Suicide Squad 2021, and Guardians of the Galaxy Vol. 3 2023. In 2022, Warner Bros. Discovery hired Gunn and Peter Safran to become co-chairmen and co-CEOs of DC Studios.",
      "Birth": "1966-08-05"
    },
    "Image": "https://m.media-amazon.com/images/I/71OLMNKaKEL._AC_UF894,1000_QL80_.jpg",
    "Featured": true,
    "url": "https://www.youtube.com/embed/u3V5KDHRQvk?si=hGkgxwJyUhWCMWxZ",
    "Saved": false
  },
  {
    "Title": "Home Alone",
    "Release": "1990",
    "Actors": [
      "Macaulay Culkin",
      "Joe Pesci",
      "Daniel Stern"
    ],
    "Rated": "PG",
    "Rating": "66",
    "Description": "When bratty 8-year-old Kevin McCallister (Macaulay Culkin) acts out the night before a family trip to Paris, his mother (Catherine O'Hara) makes him sleep in the attic. After the McCallisters mistakenly leave for the airport without Kevin, he awakens to an empty house and assumes his wish to have no family has come true. But his excitement sours when he realizes that two con men (Joe Pesci, Daniel Stern) plan to rob the McCallister residence, and that he alone must protect the family home.",
    "Genre": {
        "Name": "Comedy",
        "Description": "Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect"
    },
    "Director": {
        "Name": "Chris Columbus",
        "Bio": "One of the more successful filmmakers to come from the Spielberg school of genre moviemaking, writer-director Chris Columbus emerged as a specialist in combining a sensitivity for young people's feelings with a rousing adventure yarn. Columbus entered Hollywood by way of screenwriting with his script for 'Gremlins' (1984) being shepherded by Spielberg, who soon became a mentor to the young scribe. After writing the scripts for 'The Goonies'(1985) and 'Young Sherlock Holmes' (1985), he made his directing debut with the mild family comedy 'Adventures in Babysitting' (1987). Columbus entered the realm of blockbuster filmmaker with 'Home Alone' (1990), arguably one of the most successful film comedies of all time. Following the sequel 'Home Alone 2: Lost in New York' (1992), he had another hit with the Robin Williams vehicle 'Mrs. Doubtfire' (1993), which placed Columbus at the top of Hollywood's list of commercial hitmakers. Despite his overwhelming commercial success, Columbus struggled to earn the respect of critics, many of whom complained that he tended to overly sentimentalize his work by finding simple happy solutions to complicated problems. He typified such criticisms with 'Bicentennial Man''' (1999), which descended into cheap sentiment after a promising start. Columbus next tackled the incredibly difficult task of bring 'Harry Potter and the Sorcerer's Stone' (2001) to life on the big screen. Faithfully adapting that novel and the sequel 'Harry Potter and the Chamber of Secrets' (2002), Columbus helped launch what became one of the most commercially successful franchises in cinema history. Though he faded to the background with 'Rent'' (2005) and 'Percy Jackson & the Olympians: The Lightning Thief' (2010), Columbus remained one of Hollywood's most bankable commercial directors.",
        "Birth": "1958-09-10"
    },
    "Image": "https://image.tmdb.org/t/p/original/fTpMEyjvtsI0kVGCVhkVSp0Wa22.jpg",
    "Featured": true,
    "url": "https://www.youtube.com/watch?v=jEDaVHmw7r4",
    "Saved": false
  },
  {
    "Title": "Home Alone 2",
    "Release": "1992",
    "Actors": [
      "Macaulay Culkin",
      "Daniel Stern", 
      "Joe Pesci", 
      "John Heard", 
      "Deven Ratray", 
      "Devin Ratray", 
      "Tim Curry"
    ],
    "Rated": "PG",
    "Rating": "62",
    "Description": "After snarky youth Kevin McCallister (Macaulay Culkin) loses track of his father at the airport, he mistakenly gets on a plane headed for New York City -- while the rest of the McCallisters fly to Florida. Now alone in the Big Apple, Kevin cons his way into a room at the Plaza Hotel and begins his usual antics. But when Kevin discovers that the Sticky Bandits (Joe Pesci, Daniel Stern) are on the loose, he struggles to stop them from robbing an elderly man's toy store just before Christmas.",
    "Genre": {
        "Name": "Comedy",
        "Description": "Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect"
    },
    "Director": {
        "Name": "Chris Columbus",
        "Bio": "One of the more successful filmmakers to come from the Spielberg school of genre moviemaking, writer-director Chris Columbus emerged as a specialist in combining a sensitivity for young people's feelings with a rousing adventure yarn. Columbus entered Hollywood by way of screenwriting with his script for 'Gremlins' (1984) being shepherded by Spielberg, who soon became a mentor to the young scribe. After writing the scripts for 'The Goonies'(1985) and 'Young Sherlock Holmes' (1985), he made his directing debut with the mild family comedy 'Adventures in Babysitting' (1987). Columbus entered the realm of blockbuster filmmaker with 'Home Alone' (1990), arguably one of the most successful film comedies of all time. Following the sequel 'Home Alone 2: Lost in New York' (1992), he had another hit with the Robin Williams vehicle 'Mrs. Doubtfire' (1993), which placed Columbus at the top of Hollywood's list of commercial hitmakers. Despite his overwhelming commercial success, Columbus struggled to earn the respect of critics, many of whom complained that he tended to overly sentimentalize his work by finding simple happy solutions to complicated problems. He typified such criticisms with 'Bicentennial Man''' (1999), which descended into cheap sentiment after a promising start. Columbus next tackled the incredibly difficult task of bring 'Harry Potter and the Sorcerer's Stone' (2001) to life on the big screen. Faithfully adapting that novel and the sequel 'Harry Potter and the Chamber of Secrets' (2002), Columbus helped launch what became one of the most commercially successful franchises in cinema history. Though he faded to the background with 'Rent'' (2005) and 'Percy Jackson & the Olympians: The Lightning Thief' (2010), Columbus remained one of Hollywood's most bankable commercial directors.",
        "Birth": "1958-09-10"
    },
    "Image": "https://m.media-amazon.com/images/I/71rwGIFczGL._AC_UF894,1000_QL80_.jpg",
    "Featured": true,
    "url": "https://www.youtube.com/embed/g64dOUrwqrE?si=Z67RI0-5CRhG-CH2",
    "Saved": false
  },
  {
    "Title": "Indiana Jones and the Temple of Doom",
    "Release": "1984",
    "Actors": [ 
      "Harrison Ford", 
      "Kate Capshaw", 
      "Ke Huy Quan", 
      "Amrish Puri"
   ],
    "Rated": "PG",
    "Rating": 77,
    "Description": "In 1935, Indiana Jones is tasked by Indian villagers with reclaiming a rock stolen from them by a secret cult beneath the catacombs of an ancient palace.",
    "Genre": {
      "Name": "Adventure",
      "Description": "Adventure fiction is a type of fiction that usually presents danger, or gives the reader a sense of excitement. Some adventure fiction also satisfies the literary definition of romance fiction."
    },
    "Director": {
      "Name": "Steven Spielburg",
      "Bio": "Steven Spielburg is an American film director, producer and screenwriter. A major figure of the New Hollywood era and pioneer of the modern blockbuster, he is the most commercially successful director in history. He is the recipient of many accolades, including three Academy Awards, two BAFTA Awards, and four Directors Guild of America Awards, as well as the AFI Life Achievement Award in 1995, the Kennedy Center Honor in 2006, the Cecil B. DeMille Award in 2009 and the Presidential Medal of Freedom in 2015. Seven of his films have been inducted into the National Film Registry by the Library of Congress as culturally, historically or aesthetically significant",
      "Birth": "1946-12-18"
    },
    "Image": "https://m.media-amazon.com/images/I/61AbSnzGR+L._AC_UF894,1000_QL80_.jpg",
    "Featured": true,
    "url":"https://www.youtube.com/embed/NGsWgHNxK9c?si=gV19sOY92QUZRiVJ",
    "Saved":false
  },
  {
    "Title": "Insidious Last Key",
    "Release": "2018",
    "Actors": [ 
      "Kate Capshaw",
      "Ke Huy Quan", 
      "Amrish Puri" 
    ],
    "Rated": "PG-13",
    "Rating": "33",
    "Description": "Parapsychologist Dr. Elise Rainier faces her most fearsome and personal haounting yet, as she is drawn back to her ghostly childhood home where the terror began.",
    "Genre": {
     "Name": "Horror",
      "Description": "Horror is a film genre that seeks to elicit fear or disgust in its audience for entertainment purposes. Horror films often explore dark subject matter and may deal with transgressive topics or themes. Broad elements include monsters, apocalyptic events, and religious or folk beliefs."
    },
    "Director": {
      "Name": "Adam Robitel",
      "Bio": "Adam Robitel is an American film director, producer, screenwriter, and actor. He is best known for directing horror films, such as The Taking of Deborah Logan 2014, Insidious: The Last Key 2018, Escape Room 2019 and its sequel Escape Room: Tournament of Champions 2021. He also co-wrote Paranormal Activity: The Ghost Dimension 2015.",
      "Birth": "1978-05-26"
    },
    "Image": "https://m.media-amazon.com/images/I/61F+vUcAuvL._AC_UF894,1000_QL80_.jpg",
    "Featured": true,
    "url": "https://www.youtube.com/embed/acQyrwQyCOk?si=_4R7jkmvp0QiES29",
    "Saved": false
  },
  {
    "Title": "John Wick - Chapter 4",
    "Release": "2023",
    "Actors": [
      "Keanu Reeves",
      "Laurence Fishburne",
      "Lance Reddick",
      "Clancy Brown"
    ],
    "Rated": "R",
    "Rating": "94",
    "Description": "John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.",
    "Genre": {
      "Name": "Action",
      "Description": "Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats. The genre tends to feature a mostly resourceful hero struggling against incredible odds, which include life-threatening situations, a dangerous villain, or a pursuit which usually concludes in victory for the hero."
    },
    "Director": {
      "Name": "Chad Stahelski",
      "Bio": "Chad Stahelski is an American stuntman, actor, and film director. He was born on September 20, 1968 in the United States13. He is best known for directing the John Wick film series12. He has also worked as a stuntman, stunt coordinator, and second unit director on several films.",
      "Birth": "1968-09-20"
    },
    "Image": "https://m.media-amazon.com/images/I/61DhnZmO17L._AC_UF894,1000_QL80_.jpg",
    "Featured": true,
    "url": "https://www.youtube.com/embed/qEVUtrk8_B4?si=C4YmKJsSNGjbb5Pe",
    "Saved": false
  },
  {
    "Title": "King's Speech",
    "Release": "2010",
    "Actors": [
      "Colin Firth",
      "Geoffrey Rush",
      "Helena Bonham Carter"
    ],
    "Rated": "R",
    "Rating": "94",
    "Description": "England's Prince Albert (Colin Firth) must ascend the throne as King George VI, but he has a speech impediment. Knowing that the country needs her husband to be able to communicate effectively, Elizabeth (Helena Bonham Carter) hires Lionel Logue (Geoffrey Rush), an Australian actor and speech therapist, to help him overcome his stammer. An extraordinary friendship develops between the two men, as Logue uses unconventional means to teach the monarch how to speak with confidence.",
    "Genre": {
      "Name": "Historical",
      "Description": "The historical film genre is characterised by its focus on portraying events, societies, and figures from the past. Its a genre that aims to recreate periods in time that are detached from the present, giving viewers a chance to witness historical moments unfold on screen. This can encompass anything from ancient civilisations to biographical studies of historical figures. The significance of historical films lies in their power to educate, entertain, and provoke thought. Initially, historical films were seen as a way to bring the grandeur of history to life with lavish sets and costumes. However, as filmmaking techniques advanced, directors began to focus more on the human stories within the historical context, giving us a deeper understanding of the past."
    },
    "Director": {
      "Name": "Tom Hooper",
      "Bio": "Tom Hooper was educated at one of England's most prestigious schools, Westminster. His first film, Runaway Dog, was made when he was 13 years old and shot on a Clockwork 16mm Bolex camera, using 100 feet of film. At age 18, he wrote, directed and produced the short film Painted Faces (1992), which premiered at the London Film Festival; it was released theatrically and later shown on Channel 4. He studied English at England's top university, Oxford. At Oxford University, he directed theatre productions starring his contemporaries Kate Beckinsale and Emily Mortimer, and directed his first television commercials. His father was a non-executive director at United News and Media, which owned an ITV franchise.Hooper's father introduced him to one of British television's top directors and producers, Matthew Robinson, who gave him breaks by employing him to direct episodes of Byker Grove (1989) and EastEnders (1985), both series produced by Robinson. Further success came when he was approved by Helen Mirren to direct her in Prime Suspect: The Last Witness (2003). He then worked with her again on Elizabeth I (2005). Hooper made the difficult transition from television to film with apparent ease, directing Michael Sheen in the Brian Clough biopic The Damned United (2009) and Colin Firth in The King's Speech (2010). Both films were critical and commercial successes, quickly establishing Hooper as one of the most in demand directors of his generation.Hooper has garnered numerous awards in his career. He won an Academy Award for directing The King's Speech. The 2010 film was nominated for 12 Oscars, more than any other film of that year, and also won the Best Picture, Best Actor (Colin Firth), and Best Original Screenplay Oscars. The King's Speech received seven BAFTA Awards, including Best Film and Outstanding British Film. Hooper also won a Directors Guild of America Award for his direction. Among other accolades worldwide, The King's Speech additionally was honored with the People's Choice Award at the Toronto International Film Festival; the Best British Film prize at the British Independent Film Awards; the Spirit Award for Best Foreign Film; the Producers Guild of America Awards' top prize; and the European Film Award for Best Film. The King's Speech earned $414 million at the worldwide box office.Hooper was recently again a Directors Guild of America Award nominee for directing Working Title Films' Les Misérables. The 2012 film was nominated for eight Academy Awards, including Best Picture, and won the Best Supporting Actress (Anne Hathaway), Best Sound, and Best Make-up and Hair Styling Academy Awards. Les Misérables received those same accolades at the BAFTA Awards, as well as the BAFTA for Best Production Design. Among other accolades worldwide, Les Misérables was named one of the year's 10 Best Films by the American Film Institute with an AFI Award; won three Golden Globe Awards including Best Picture [Musical/Comedy]; was voted the Best Acting by an Ensemble award by the National Board of Review; and was nominated for four Screen Actors Guild Awards. Les Misérables earned $442 million at the worldwide box office. The Damned United received a South Bank Show Award nomination for Best British Film; and he gained acclaim for the BAFTA Award-nominated Red Dust, starring Hilary Swank and Chiwetel Ejiofor. Hooper had an unprecedented run of success at the Golden Globe Awards with his works for HBO, which won the Golden Globe for Best Mini-Series or Motion Picture Made for Television three years in a row. The actors and actresses starring in these productions - respectively, Elizabeth I, Longford, and John Adams - also won Golden Globes for their performances three years running. Hooper won an Emmy Award for directing Elizabeth I. The HBO Films/Channel 4 miniseries won three Golden Globes and nine Emmy Awards, including Outstanding Miniseries. Longford, written by Peter Morgan, starred Jim Broadbent and Samantha Morton. The HBO Films/Channel 4 Telefilm won three Golden Globe Awards and was nominated for five Emmy Awards. John Adams (2008), starring Paul Giamatti and Laura Linney, won four Golden Globes and 13 Emmy Awards - the most Emmys ever awarded to a program in one year. Hooper, receiving his first Directors Guild of America Award nomination, directed all nine hours of the HBO Films miniseries. Hooper was nominated for an Emmy Award for helming ITV's miniseries Prime Suspect 6. His television work also includes Daniel Deronda (2002), which won the award for Best Miniseries at the 2003 Banff Television Festival; the miniseries Love in a Cold Climate (2001), for which star Alan Bates received a BAFTA Award nomination; episodes of the multi-award-winning ITV comedy/drama Cold Feet (1997); and EastEnders (1985)"
    },
    "Image": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fcdn.traileraddict.com%2Fcontent%2Fthe-weinstein-company%2Fthe_kings_speech-10.jpg&f=1&nofb=1&ipt=d179f3032b481bf3a43e5467be01ca83c255c074647f957aab3b59ca25e98c9a&ipo=images",
    "url": "https://www.youtube.com/watch?v=EcxBrTvLbBM",
    "Saved": false
  },
  {
    "Title": "La La Land",
    "Release": "2016",
    "Actors": [
      "Ryan Gosling",
      "Emma Stone",
      "Amiee Conn",	
      "Terry Walters",
      "Thom Shelton",
      "Cinda Adams",
      "Callie Hernandez",
      "Jessica Rothe",
      "Sonoya Mizuno",
      "Rosemarie DeWitt",
      "J.K. Simmons",
      "Claudine Claudio",
      "Jason Fuchs",
      "D.A. Wallach",
      "Mike Fallin",
      "Trevor Lissauer",
      "Olivia Hamilton",
      "Anna Chazelle",
      "Marius De Vries",
      "Finn Wittrock",
      "Josh Pence",
      "Nicole Coulon",
      "Damon Gupton",
      "John Legend",
      "Christopher Michael",
      "Keith Harris",
      "Kaveh Rastegar",
      "Shaylah J. Stevens",
      "Natalie Imani",
      "Briana Lee",
      "David Douglas",
      "Miles Anderson",
      "Bobo Chang",
      "Meagen Fay",
      "Robert Haynes",
      "John Hindman",
      "Valarie Rae Miller",
      "Nicole Wolf",
      "Corrin Evans",
      "Kiff VandenHeuvel",
      "Tom Everett Scott",
      "Camryn Ray Cavaliero",
      "Zoë Hall",
      "Dempsey Pappion",
      "Clifton 'Fou Fou' Eddie",
      "Cal Bennett",
      "Nedra Wheeler",
      "Javier Gonzalez",
      "Khirye Tyler",
      "Arthur Horowitz",
      "Reshma Gajjar",
      "Hunter Hamilton",
      "Damian Gomez",
      "Candice Coke",
      "Amanda Balen",
      "Mecca Vazie Andrews",
      "Lou Becker",
      "Doran Butler",
      "Matt Cady",	
      "Dominic Chaiduang",
      "Cindera Che",
      "Carol Connors",
      "Patrick Cook",
      "Aaron Cooke",
      "Tiffany Daniels",
      "Bubba Dean Rambo",
      "Nick Drago",
      "Shaun Evaristo",
      "Dana Fukagawa",
      "Daniel Gaymon",
      "Liz Imperio",
      "Casey Johansen",
      "Cris Judd",
      "Yoori Kim",
      "Marissa Labog",
      "Stephanie Landwehr",
      "Chris Moss",
      "Clarice Ordaz",
      "Nathan Prevost",
      "Bradley M. Rapier",
      "Britt Stewart",
      "Melinda Sullivan",
      "Dana Wilson",
      "Terrance Yates",	
      "Tracy Shibata",
      "Dominique Domingo",
      "Asiel Hardison",
      "Corey Anderson",
      "Nick Baga",
      "Scott Hislop",
      "Leah Adler",
      "Noel Bajandas",
      "Khasan Brailsford",
      "Denzel Chisolm",
      "Montana Efaw",
      "Krystal Ellsworth",
      "Natalie Gilmore",
      "Shannon Holtzapffel",
      "Galen Hooks",
      "Jeremy Hudson",
      "Morgan Larson",
      "George Lawrence Jr.",
      "Sarah Mitchell",
      "Kc Monnie",
      "Scott Myrick",
      "Cassidy Noblett",
      "Brittany Parks",
      "Victor Rojas",
      "Tony Bellissimo",
      "Ryan Ramirez",
      "Catalina Cat Rendic",
      "Bryan Tanaka",
      "Ava Bernstine",
      "Mario Diaz",
      "Quinn Lipton",
      "Gakenia Muigai",
      "Becca Sweitzer",
      "Samantha Abrantes",
      "Monie Adamson",
      "Matthew Aylward",
      "McKenzie Anderson",
      "Sybil Azur",
      "Demian Boergadine",
      "Pamela Chu",
      "Lexie Contursi",
      "Mallauri Esquibel",
      "Michael Higgins",
      "Tara Nicole Hughes",
      "Chris Jarosz",
      "Kayla Kalbfleisch",
      "Matthew Kazmierczak",
      "Paul Kirkland",
      "Megan Lawson",
      "Anthony Marciona",
      "Michael Munday",
      "Martha Nichols",
      "Ryan Novak",
      "Brandon O'Neal",
      "Bill Prudich",
      "Eartha Robinson",
      "Robert Roldan",
      "Julie Schmid",
      "Danny Valle",
      "Gustavo Vargas",
      "Emily Williams"
  ],
  "Rated": "PG-13",
  "Description": "Sebastian (Ryan Gosling) and Mia (Emma Stone) are drawn together by their common desire to do what they love. But as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
  "Genre": {
    "Name": "Musical",
    "Description": "Musical film, motion picture consisting of a plot integrating musical numbers. Although usually considered an American genre, musical films from Japan, Italy, France, Great Britain, and Germany have contributed to the development of the type. The first musical film, The Jazz Singer (1927), starring Al Jolson, introduced the sound era of motion pictures. It was followed by a series of musicals hastily made to capitalize on the novelty of sound. One of the few outstanding films of this early period was Broadway Melody (1929), which won the Academy Award for best picture of 1928–29."
  },
  "Director": {
    "Name": "Damien Chazelle",
    "Description": "For Whiplash, he was nominated for the Academy Award for Best Adapted Screenplay. His biggest commercial success came with La La Land, which was nominated for 14 Academy Awards, winning six including Best Director, making him the youngest person to win the award at age 32.[4][5] He has directed two episodes of the Netflix limited series The Eddy (2020)",
    "Birth": "1985-01-19"
  },
  "Image": "https://m.media-amazon.com/images/I/61dlgdTY3nL._AC_SX679_.jpg",
  "url":"https://www.youtube.com/watch?v=0pdqf4P9MB8",
  "Saved": false
},
{
  "Title": "Indiana Jones and the Last Crusade",
  "Release": "1989",
  "Actors": [
  "Harrison Ford",
  "Sean Connery",
  "Alison Doody"
  ],
  "Rated": "PG-13",
  "Rating": "84",
  "Description": "An art collector appeals to Jones to embark on a search for the Holy Grail. He learns that another archaeologist has disappeared while searching for the precious goblet, and the missing man is his own father, Dr. Henry Jones. The artifact is much harder to find than they expected, and its powers are too much for those impure in heart.",
  "Genre": {
    "Name": "Adventure",
    "Description":"Adventure fiction is a type of fiction that usually presents danger, or gives the reader a sense of excitement. Some adventure fiction also satisfies the literary definition of romance fiction."
  },
  "Director": {
    "Name": "Steven Spielburg",
    "Bio": "Steven Spielburg is an American film director, producer and screenwriter. A major figure of the New Hollywood era and pioneer of the modern blockbuster, he is the most commercially successful director in history. He is the recipient of many accolades, including three Academy Awards, two BAFTA Awards, and four Directors Guild of America Awards, as well as the AFI Life Achievement Award in 1995, the Kennedy Center Honor in 2006, the Cecil B. DeMille Award in 2009 and the Presidential Medal of Freedom in 2015. Seven of his films have been inducted into the National Film Registry by the Library of Congress as culturally, historically or aesthetically significant",
    "Birth": "1946-12-18"
  },
  "Image": "https://www.vintagemovieposters.co.uk/wp-content/uploads/2021/06/IMG_2497-1383x2048.jpeg",
  "url": "https://youtu.be/DKg36LBVgfg",
  "Saved":false
},
  {
    "Title": "Raiders of the Lost Ark",
    "Release": "1981",
    "Actors": [
      "Harrison Ford",
      "Karen Allen",
      "Paul Freeman",
      "John Rhys-Davies"
    ],
    "Rated": "PG",
    "Rating": "93",
    "Description": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before the Nazis can obtain its awesome powers.",
    "Genre": {
      "Name": "Adventure",
      "Description": "Adventure fiction is a type of fiction that usually presents danger, or gives the reader a sense of excitement. Some adventure fiction also satisfies the literary definition of romance fiction."
    },
    "Director": {
      "Name": "Steven Spielburg",
      "Bio": "Steven Spielburg is an American film director, producer and screenwriter. A major figure of the New Hollywood era and pioneer of the modern blockbuster, he is the most commercially successful director in history. He is the recipient of many accolades, including three Academy Awards, two BAFTA Awards, and four Directors Guild of America Awards, as well as the AFI Life Achievement Award in 1995, the Kennedy Center Honor in 2006, the Cecil B. DeMille Award in 2009 and the Presidential Medal of Freedom in 2015. Seven of his films have been inducted into the National Film Registry by the Library of Congress as culturally, historically or aesthetically significant",
      "Birth": "1946-12-18"
    },
    "Image": "https://m.media-amazon.com/images/I/71fRbA8AX4L._AC_UF894,1000_QL80_.jpg",
    "url":"https://www.youtube.com/watch?v=XkkzKHCx154",
    "Saved": false
  },
  {
    "Title": "Rebel Moon: Part One – A Child of Fire",
    "Release": "2023",
    "Actors": [
      "Sofia Boutella",
      "Cary Elwes",
      "Charlie Hunnam",
      "Anthony Hopkins"
    ],
    "Rated": "PG-13",
    "Rating": "100",
    "Description": "When a peaceful colony on the edge of a galaxy finds itself threatened by the armies of a tyrannical ruling force, Kora (Sofia Boutella), a mysterious stranger living among the villagers, becomes their best hope for survival. Tasked with finding trained fighters who will unite with her in making an impossible stand against the Mother World, Kora assembles a small band of warriors -- outsiders, insurgents, peasants and orphans of war from different worlds who share a common need for redemption and revenge. As the shadow of an entire Realm bears down on the unlikeliest of moons, a battle over the fate of a galaxy is waged, and in the process, a new army of heroes is formed.",
    "Genre": {
      "Name": "Sci-Fi",
      "Description": "Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, dinosaurs, mutants, interstellar travel, time travel, or other technologies. Science fiction films have often been used to focus on political or social issues, and to explore philosophical issues like the human condition."
    },
    "Director": {
      "Name": "Zack Snyder",
      "Bio": "Snyder is known for his highly stylized Spartan epic, 300 (2007), a box-office smash based on the graphic novel by Frank Miller. Snyder then went to make Watchmen (2009), the ground-breaking comic book miniseries written by Alan Moore. Looking to work on something fraught with less potential for controversy, he helmed the CGI family fantasy Legend of the Guardians: The Owls of Ga'Hoole (2010), then wrote, produced and directed the wildly self-indulgent genre mash-up spectacle Sucker Punch (2011), about a young girl (Emily Browning) who escapes the real world horrors of a mental asylum by retreating into her own fantasies. Resuscitating the Superman franchise with the highly-anticipated Man of Steel (2013) was merely one more make-or-break challenge for the director. Accused of favoring style over substance by his detractors, Snyder unapologetically offered up his films to the fans as pure popcorn entertainment.",
      "Birth": "1966-03-01"
    },
    "Image": "https://m.media-amazon.com/images/I/81VCu1mAEvL._AC_UF894,1000_QL80_.jpg",
    "Featured": false,
    "url": "https://www.youtube.com/embed/_rHLOXbFZtI?si=wL2UHn_ANIwbdt2o",
    "Saved" : false
  },
  {
    "Title": "Sound of Music",
    "Release": "`1965",
    "Actors": [
      "Julie Andrews",
      "Christopher Plummer",
      "Eleanor Parker"
    ],
    "Rated": "G",
    "Rating": "83",
    "Description": "A young novice is sent by her convent in 1930s Austria to become a governess to the seven children of a widowed naval officer.",
    "Genre": {
      "Name": "Musical",
      "Description": "Musical film, motion picture consisting of a plot integrating musical numbers. Although usually considered an American genre, musical films from Japan, Italy, France, Great Britain, and Germany have contributed to the development of the type. The first musical film, The Jazz Singer (1927), starring Al Jolson, introduced the sound era of motion pictures. It was followed by a series of musicals hastily made to capitalize on the novelty of sound. One of the few outstanding films of this early period was Broadway Melody (1929), which won the Academy Award for best picture of 1928–29."
    },
    "Director":{
      "Name": "Robert Earl Wise",
      "Bio" : "Robert Earl Wise (September 10, 1914 – September 14, 2005) was an American filmmaker. He won the Academy Awards for Best Director and Best Picture for his musical films West Side Story (1961) and The Sound of Music (1965). He was also nominated for Best Film Editing for Citizen Kane (1941) and directed and produced The Sand Pebbles (1966), which was nominated for Best Picture. Among his other films are The Body Snatcher (1945), Born to Kill (1947), The Set-Up (1949), The Day the Earth Stood Still (1951), Destination Gobi (1953), This Could Be The Night (1957), Run Silent, Run Deep (1958), I Want to Live! (1958), The Haunting (1963), The Andromeda Strain (1971), The Hindenburg (1975) and Star Trek: The Motion Picture (1979). He was the president of the Directors Guild of America from 1971 to 1975 and the president of the Academy of Motion Picture Arts and Sciences from 1985 through 1988. Wise achieved critical success as a director in a striking variety of film genres: horror-noir, western, war, science fiction, musical and drama, with many repeat successes within each genre. Wise's meticulous preparation may have been largely motivated by studio budget constraints, but advanced the moviemaking art. He received the AFI Life Achievement Award in 1998.",
      "Birth": "1914-09-10",
      "Death": "2005-09-14"
    },
    "Image": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fwww.themoviedb.org%2Ft%2Fp%2Foriginal%2FoqiKacmJ7OwAlXIRTtxnXxdEZYx.jpg&f=1&nofb=1&ipt=d27b4166c02aec43eafd2f277902a4c33e734913c6700746ff7b323e27361c97&ipo=images",
    "url":"https://www.youtube.com/watch?v=bZNcqtx83Io",
    "Saved": false
  },
  {
    "Title": "The Covenant",
    "Release": "2023",
    "Actors": [ 
      "Jake Gyllenhaai", 
      "Dar Salim", 
      "Jason Wong", 
      "Rhys Yates" 
    ],
    "Rated": "R",
    "Rating": "83",
    "Description": "During the war in Afghanistan, a local interpreter risks his own life to carry an injured sergeant across miles of grueling terrain.",
    "Genre": {
      "Name": "War",
      "Description": "War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama. It has been strongly associated with the 20th century.[1][2] The fateful nature of battle scenes means that war films often end with them. Themes explored include combat, survival and escape, camaraderie between soldiers, sacrifice, the futility and inhumanity of battle, the effects of war on society, and the moral and human issues raised by war."
    },
    "Director": {
      "Name": "Guy Ritchie",
      "Bio": "Guy Ritchie is a British film director, writer, producer, and businessman12345. He is known for his trademark crime thrillers and suspense films, such as Lock, Stock and Two Smoking Barrels and Snatch1234. Ritchie left school at age 15 and worked entry-level jobs in the film industry before going on to direct television commercials2. He has also directed the Sherlock Holmes films starring Robert Downey Jr.24. Ritchie is occasionally an actor, pub landlord, and businessman",
      "Birth": "1968-09-10"
    },
    "Image": "https://m.media-amazon.com/images/I/71bIMJobeeL._AC_UF894,1000_QL80_.jpg",
    "Featured": true,
    "url": "https://www.youtube.com/embed/02PPMPArNEQ?si=kv7YGswbnEGCP6Yc",
    "Saved": false
  },
  {
    "Title": "The Maltese Falcon",
    "Release": "1941",
    "Actors": [
      "Humphrey Bogart",
      "Mary Astor",
      "Gladys George"
    ],
    "Rated": "PG",
    "Rating": "99",
    "Description": "In this noir classic, detective Sam Spade (Humphrey Bogart) gets more than he bargained for when he takes a case brought to him by a beautiful but secretive woman (Mary Astor). As soon as Miss Wonderly shows up, trouble follows as Sam's partner is murdered and Sam is accosted by a man (Peter Lorre) demanding he locate a valuable statuette. Sam, entangled in a dangerous web of crime and intrigue, soon realizes he must find the one thing they all seem to want: the bejeweled Maltese falcon.",
    "Genre": {
      "Name": "Mystery",
      "Description": "Mystery -Film noir (/nwɑːr/; French: [film nwaʁ]) is a cinematic term used primarily to describe stylized Hollywood crime dramas, particularly those that emphasize cynical attitudes and motivations. The 1940s and 1950s are generally regarded as the classic period of American film noir. Film noir of this era is associated with a low-key, black-and-white visual style that has roots in German Expressionist cinematography. Many of the prototypical stories and attitudes expressed in classic noir derive from the hardboiled school of crime fiction that emerged in the United States during the Great Depression."
    },
    "Director": {
      "Name" : "John Huston",
      "Bio": "Huston led quite an adventurous life even before he began his Hollywood career, often recalling his days as a boxer, Mexican cavalry officer and avid horseback rider in many of his films. After a false start as a screenwriter in the early days of talkies, Huston re-emerged in the late-1930s as a successful contract writer who penned such hits as The Amazing Dr. Clitterhouse (1938), Sergeant York (1941) and High Sierra (1941). During this time, he developed a strong working collaboration with Humphrey Bogart, who became a major star following his turn in Huston's directorial debut, The Maltese Falcon (1941), one of the best film noirs ever made. The two had even greater success with The Treasure of Sierra Madre (1948), which earned Huston and his father, actor Walter Huston, Academy Awards. From there, the director entered into what became his most fruitful period, helming such long-held classics as The Asphalt Jungle (1950),The Red Badge of Courage (1951) and The African Queen (1952), which delivered Bogie his only Oscar. He also began acting later in his career, turning in an acclaimed supporting performance in The Cardinal (1963) while being best remembered for his portrayal of the vile Noah Cross in Chinatown (1974). In the last decade of his life, Huston returned to critical and box office prominence with Prizzi's Honor (1985), which earned daughter Anjelica an Academy Award, making the Hustons the first family to win Oscars in three successive generations. As for Huston himself, he left behind a compelling legacy that included an adventurous life and a career that cemented him as arguably the greatest director in Hollywood history.",
      "Birth" : "1906-08-05",
      "Death": "1987-08-28"
    },
    "Image": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2F2.bp.blogspot.com%2F-AOK-0Z7RFxo%2FUbf5n2cfl_I%2FAAAAAAAATNw%2FUYT6-3SlaMo%2Fs1600%2FPoster%2B-%2BMaltese%2BFalcon%2C%2BThe%2B(1941)_01.jpg&f=1&nofb=1&ipt=30615622088261b6430dda0179a0edb4d5f122c04c4f411d6a28635ef9c153e6&ipo=images",
    "url": "https://www.youtube.com/watch?v=Yv-BPuqhW9U",
    "Saved": false
  },
  {
    "Title": "12 Angry Men",
    "Release": "1957",
    "Actors": [
      "Ed Begley",
      "E.G Marshall",
      "Edward Binns",
      "George Voskovec",
      "Henry Fonda",
      "Jack Klugman",
      "Jack Warden",
      "John Fiedler",
      "Joseph Sweeney",
      "Lee J. Cobb",
      "Martin Balsam",
      "Robert Webber"
    ],
    "Rated": "NA",
    "Rating": "100",
    "Description": "Angry Men is a 1957 American legal drama film directed by Sidney Lumet, adapted from a 1954 teleplay of the same name by Reginald Rose. The film tells the story of a jury of 12 men as they deliberate the conviction or acquittal of a teenager charged with murder on the basis of reasonable doubt; disagreement and conflict among them force the jurors to question their morals and values.",
    "Genre": {
      "Name": "Drama",
      "Description": "In film and television, drama is a category or genre of narrative fiction or semi-fiction intended to be more serious than humorous in tone. The drama of this kind is usually qualified with additional terms that specify its particular super-genre, macro-genre, or micro-genre,[2] such as soap opera, police crime drama, political drama, legal drama, historical drama, domestic drama, teen drama, and comedy-drama. These terms tend to indicate a particular setting or subject matter, or they combine a drama's otherwise serious tone with elements that encourage a broader range of moods. To these ends, a primary element in a drama is the occurrence of conflict—emotional, social, or otherwise—and its resolution in the course of the storyline."
    },
    "Director": {
      "Name": "Sideny Lumet",
      "Bio": "'Lumet started his career in theatre before transitioning to film where he gained a reputation for making realistic and gritty New York dramas which focused on the working class, tackled social injustices and often questioned authority. Lumet is often identified as part of the New Hollywood wave of filmmakers such as Martin Scorsese, Robert Altman, Francis Ford Coppola, George Lucas, and Woody Allen",
      "Birth": "1924-06-25",
      "Death": "2011-04-09"      
    },
    "Image": "https://m.media-amazon.com/images/I/51BXcmhQxjL._AC_UF894,1000_QL80_.jpg",
    "Featured": true,
    "url": "https://www.youtube.com/embed/TEN-2uTi2c0?si=efK9BRwNk5qWC-GG",
    "Saved": false
  },
  {
    "Title": "Witness for the Prosecution",
    "Release": "1957",
    "Actors": [
      "Tyrone Power",
      "Marlene Dietrich",
      "Charles Laughton",
      "Elsa Lanchester",
      "James Williams"
    ],
    "Rated": "NR",
    "Rating": "100",
    "Description": "A courtroom drama about a young man on trial for a wealthy widow's murder after he suspiciously profits from her will.",
    "Genre": {
      "Name": "Drama",
      "Description": "In film and television, drama is a category or genre of narrative fiction or semi-fiction intended to be more serious than humorous in tone. The drama of this kind is usually qualified with additional terms that specify its particular super-genre, macro-genre, or micro-genre,[2] such as soap opera, police crime drama, political drama, legal drama, historical drama, domestic drama, teen drama, and comedy-drama. These terms tend to indicate a particular setting or subject matter, or they combine a drama's otherwise serious tone with elements that encourage a broader range of moods. To these ends, a primary element in a drama is the occurrence of conflict—emotional, social, or otherwise—and its resolution in the course of the storyline."
    },
      "Director": {
        "Name": "Billy Wildere",
        "Bio": "American motion-picture scenarist, director, and producer known for films that humorously treat subjects of controversy and offer biting indictments of hypocrisy in American life. His work often focused on subjects that had previously been considered unacceptable screen material, including alcoholism (The Lost Weekend, 1945), prisoner-of-war camps (Stalag 17, 1953), and prostitution (Irma La Douce, 1963). A number of his films, such as Sunset Boulevard (1950) and The Apartment (1960), weighed the emptiness of modern life.",
        "Birth": "1906-06-22",
        "Death": "2002-03-27"
      },
      "Image": "https://m.media-amazon.com/images/I/71Y+fuZQFyL._AC_UF894,1000_QL80_.jpg",
     "Featured": true,
     "url": "https://www.youtube.com/embed/x_NKeisPXgI?si=iqrCyLdROIMuwpcP",
     "Saved": false
    }
]

